#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПерерасчетСтрокиТабЧасти();
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПересчетИтогов()
КонецПроцедуры

#Конецобласти

#Область СлужебныеПроцедурыИФункции


&НаКлиенте
Процедура ПерерасчетСтрокиТабЧасти()
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
	ПересчетИтогов()
КонецПроцедуры

&НаКлиенте
Процедура ПересчетИтогов()
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");
КонецПроцедуры
#КонецОбласти

